# Загрузка данных и обработка

## Импорт и загрузка

In [1]:
import pandas as pd

In [2]:
# Убирает пробелы при загрузке датасета
def strip(text):
    try:
        return text.strip()
    except AttributeError:
        return text
# Понадобилось самому задавать имена колонок, т.к. считывались с пробелами
# К тому же, пришлось сделать strip на все коорд. данные, они (вообще все) данные идут с лишними пробелами
raw_data = pd.read_csv('checkins.dat', delimiter='|', 
                   names=['id', 'user_id', 'latitude', 'longitude', 'created_at'], header=0, 
                   converters={'latitude': strip, 'longitude': strip})

/home/aleksei/.virtualenvs/python2/local/lib/python2.7/site-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
raw_data.head()

,id,user_id,latitude,longitude,created_at
---------+---------+----------+-------------------+-------------------+---------------------,NaN,NaN,,,NaN
984301,2041916.0,5222.0,,,2012-04-21 17:39:01
984222,15824.0,5222.0,38.8951118,-77.0363658,2012-04-21 17:43:47
984315,1764391.0,5222.0,,,2012-04-21 17:37:18
984234,44652.0,5222.0,33.800745,-84.41052,2012-04-21 17:43:43

In [4]:
raw_data = raw_data.dropna()

In [5]:
raw_data.head()

                  id  user_id    latitude    longitude            created_at
  984301   2041916.0   5222.0                            2012-04-21 17:39:01
  984222     15824.0   5222.0  38.8951118  -77.0363658   2012-04-21 17:43:47
  984315   1764391.0   5222.0                            2012-04-21 17:37:18
  984234     44652.0   5222.0   33.800745    -84.41052   2012-04-21 17:43:43
  984249   2146840.0   5222.0                            2012-04-21 17:42:58

## Отсечение данных без координат

In [7]:
ready_data = raw_data[(raw_data.latitude != '') & (raw_data.longitude != '')]

In [8]:
ready_data.head()

                  id   user_id    latitude     longitude            created_at
  984222     15824.0    5222.0  38.8951118   -77.0363658   2012-04-21 17:43:47
  984234     44652.0    5222.0   33.800745     -84.41052   2012-04-21 17:43:43
  984291    105054.0    5222.0  45.5234515  -122.6762071   2012-04-21 17:39:22
  984318   2146539.0    5222.0   40.764462   -111.904565   2012-04-21 17:35:46
  984232     93870.0  380645.0  33.4483771  -112.0740373   2012-04-21 17:38:18

#### Готово. Теперь с датасетом можно работать